CLASSIFIER

Read Blogtext.zip into a pandas DataFrame and examine it. Please note that pandas can directly read tsv/csv files inside a zip file

In [ ]:
#from google.colab import drive
#drive.mount('/content/drive')

In [1]:
import pandas as pd
import numpy as np
import nltk

In [2]:
blog_df = pd.read_csv('blogtext.csv.zip')

In [3]:
# read file into pandas using a relative path. Please change the path as needed
#blog_df = pd.read_csv('/content/drive/My Drive/Statistical NLP/blogtext.csv.zip')

In [4]:
blog_df.head()

,id,gender,age,topic,sign,date,text
0,2059027,male,15,Student,Leo,"14,May,2004","Info has been found (+/- 100 pages,..."
1,2059027,male,15,Student,Leo,"13,May,2004",These are the team members: Drewe...
2,2059027,male,15,Student,Leo,"12,May,2004",In het kader van kernfusie op aarde...
3,2059027,male,15,Student,Leo,"12,May,2004",testing!!! testing!!!
4,3581210,male,33,InvestmentBanking,Aquarius,"11,June,2004",Thanks to Yahoo!'s Toolbar I can ...

In [5]:
#Check the contents of dataframe
blog_df.sample(n=5)

,id,gender,age,topic,sign,date,text
244543,2730505,male,24,Technology,Cancer,"06,August,2004","Apperently, the other layout was a litt..."
448214,3212073,male,23,indUnk,Taurus,"20,May,2004",Well. Mr. Wiggly went to the doctor to...
373680,3963643,female,15,Student,Pisces,"02,August,2004",* I've been carrying the weight of ...
519603,3840766,female,48,indUnk,Libra,"04,July,2004",Yankee fans. Gotta love 'em. ...
181811,3076129,female,15,indUnk,Gemini,"22,July,2004",Perhaps the blog just doesn'...

In [6]:
blog_df.shape

(681284, 7)

In [7]:
type(blog_df)

pandas.core.frame.DataFrame

In [8]:
blog_df.isna().any()# check if any null values

id        False
gender    False
age       False
topic     False
sign      False
date      False
text      False
dtype: bool

In [10]:
blog_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 681284 entries, 0 to 681283
Data columns (total 7 columns):
id        681284 non-null int64
gender    681284 non-null object
age       681284 non-null int64
topic     681284 non-null object
sign      681284 non-null object
date      681284 non-null object
text      681284 non-null object
dtypes: int64(2), object(5)
memory usage: 36.4+ MB

In [11]:
# We dont need id and date for the text classification in this blog study. they are of less value
blog_df = blog_df.drop(['id', 'date'], axis = 1)

In [12]:
blog_df.head()

,gender,age,topic,sign,text
0,male,15,Student,Leo,"Info has been found (+/- 100 pages,..."
1,male,15,Student,Leo,These are the team members: Drewe...
2,male,15,Student,Leo,In het kader van kernfusie op aarde...
3,male,15,Student,Leo,testing!!! testing!!!
4,male,33,InvestmentBanking,Aquarius,Thanks to Yahoo!'s Toolbar I can ...

In [13]:
# converting all columns to similar data type
blog_df['age'] = blog_df['age'].astype('object')

In [14]:
blog_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 681284 entries, 0 to 681283
Data columns (total 5 columns):
gender    681284 non-null object
age       681284 non-null object
topic     681284 non-null object
sign      681284 non-null object
text      681284 non-null object
dtypes: object(5)
memory usage: 26.0+ MB

Convert to Lower case

In [15]:
# Removing unwanted cahracters and spaces
import re
blog_df['text'] = blog_df['text'].apply(lambda x: re.sub(r'[^A-Za-z]+',' ',x))

In [16]:
blog_df['text'] = blog_df['text'].apply(lambda s: s.lower())

In [17]:
blog_df['text'] = blog_df['text'].apply(lambda s: s.strip())

In [18]:
from nltk.corpus import stopwords
stopwords=set(stopwords.words('english'))

In [19]:
blog_df['text']=blog_df['text'].apply(lambda x: ' '.join([words for words in x.split() if words not in stopwords]))

In [20]:
blog_df['labels']=blog_df.apply(lambda col: [col['gender'],str(col['age']),col['topic'],col['sign']], axis=1)

In [21]:
blog_df = blog_df[['text', 'labels']]
blog_df.head()

,text,labels
0,info found pages mb pdf files wait untill team...,"[male, 15, Student, Leo]"
1,team members drewes van der laag urllink mail ...,"[male, 15, Student, Leo]"
2,het kader van kernfusie op aarde maak je eigen...,"[male, 15, Student, Leo]"
3,testing testing,"[male, 15, Student, Leo]"
4,thanks yahoo toolbar capture urls popups means...,"[male, 33, InvestmentBanking, Aquarius]"

In [22]:
#Separating Data into feature and label and splitting to train and test

In [23]:
X = blog_df['text']
y = blog_df['labels']

In [9]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.25)

NameError: name 'X' is not defined

In [24]:
#Vectorize the features
from sklearn.feature_extraction.text import CountVectorizer
cv = CountVectorizer(binary=True, ngram_range=(1,2))

In [ ]:
X = cv.fit_transform(X)